InformationRegisters/СписокЗадачБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СписокЗадачБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/СписокЗадачБухгалтера/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокЗадачБухгалтера();
	
КонецПроцедуры

// Процедура - обработчик события ПриЗакрытии.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("СписокЗадачБухгалтера_Изменение");	
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокЗадачБухгалтера" Тогда
		ОбновитьСписокЗадачБухгалтера();	
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗадач

// Процедура - обработчик события ПриИзменении таблицы ТаблицаЗадач.
//
&НаКлиенте
Процедура ТаблицаЗадачПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТаблицаЗадач.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура();
	СтруктураСтроки.Вставить("Срок", 		СтрокаТабличнойЧасти.Срок);
	СтруктураСтроки.Вставить("Задача", 		СтрокаТабличнойЧасти.Задача);
	СтруктураСтроки.Вставить("ДатаПлана", 	СтрокаТабличнойЧасти.ДатаПлана);
	СтруктураСтроки.Вставить("Выполнено", 	СтрокаТабличнойЧасти.Выполнено);
	СтруктураСтроки.Вставить("Комментарий", СтрокаТабличнойЧасти.Комментарий);
	
	ТаблицаЗадачПриИзмененииНаСервере(СтруктураСтроки);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполнения реквизита формы ТаблицаЗадач.
//
&НаСервере
Процедура ОбновитьСписокЗадачБухгалтера()
	ТаблицаЗадач.Загрузить(ОбщегоНазначенияБПСервер.ПолучитьСписокЗадачБухгалтера(Истина));	
КонецПроцедуры

// Процедура обновления/создания записей РС "ЗадачиБухгалтера".
//
&НаСервере
Процедура ТаблицаЗадачПриИзмененииНаСервере(СтруктураСтроки)
		
	НаборЗаписей = РегистрыСведений.СписокЗадачБухгалтера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Срок.Установить(СтруктураСтроки.Срок);
	НаборЗаписей.Отбор.Задача.Установить(СтруктураСтроки.Задача);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);
	
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти
